Revit 2024 API
BuiltInFailures.CurtainGridFamilyFailures.PanelsSlightlyMalformedWarning Property
 Some panels in this curtain system are slightly malformed. The problem is most likely ignorable. This problem usually occurs when a panel or parts of a panel have been divided so that they are very narrow. To better see the malformed panels, temporarily hide the mullion category and set display of lines to ""thin lines"" (using the command on the view menu).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PanelsSlightlyMalformedWarning { get; }
Visual Basic
Public Shared ReadOnly Property PanelsSlightlyMalformedWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PanelsSlightlyMalformedWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace